// 문제 : 피자 나눠먹기(1)
// 머쓱이네 피자가게는 피자를 일곱 조각으로 잘라 줍니다. 피자를 나눠먹을 사람의 수 n이 주어질 때, 모든 사람이 피자를 한 조각 이상 먹기 위해 필요한 피자의 수를 return 하는 solution 함수를 완성해보세요.
// 제한사항
// 1 ≤ n ≤ 100
// 입출력 예
// n	result
// 7	1
// 1	1
// 15	3
// 입출력 예 설명
// 입출력 예 #1

// 7명이 최소 한 조각씩 먹기 위해서 최소 1판이 필요합니다.
// 입출력 예 #2

// 1명은 최소 한 조각을 먹기 위해 1판이 필요합니다.
// 입출력 예 #3

// 15명이 최소 한 조각씩 먹기 위해서 최소 3판이 필요합니다.

function solve(n) {
  return Math.ceil(n / 7);
}

// 문제 : 피자 나눠먹기(2)
// 머쓱이네 피자가게는 피자를 두 조각에서 열 조각까지 원하는 조각 수로 잘라줍니다. 피자 조각 수 slice와 피자를 먹는 사람의 수 n이 매개변수로 주어질 때, n명의 사람이 최소 한 조각 이상 피자를 먹으려면 최소 몇 판의 피자를 시켜야 하는지를 return 하도록 solution 함수를 완성해보세요.
//
// 제한사항
// 2 ≤ slice ≤ 10
// 1 ≤ n ≤ 100
// 입출력 예
// slice	n	result
// 7	10	2
// 4	12	3
// 입출력 예 설명
// 입출력 예 #1
//
// 10명이 7조각으로 자른 피자를 한 조각 이상씩 먹으려면 최소 2판을 시켜야 합니다.
// 입출력 예 #2
//
// 12명이 4조각으로 자른 피자를 한 조각 이상씩 먹으려면 최소 3판을 시켜야 합니다.

function solve(slice, n) {
  return Math.ceil(n / slice);
}
